app/controllers/projs_controller.rb

  def index
    @projs = Proj.all
---
SELECT * FROM `projs`

  def show
    @current="overview"
    @proj = Proj.find(params[:id])
---
SELECT * FROM `projs` WHERE (`projs`.`id` = 953125641)

  def edit
    @proj = Proj.find(params[:id])
---
SELECT * FROM `projs` WHERE (`projs`.`id` = 953125641)

  def update
    @proj = Proj.find(params[:id])
---
SELECT * FROM `projs` WHERE (`projs`.`id` = 953125641)

  def destroy
    @proj = Proj.find(params[:id])
---
SELECT * FROM `projs` WHERE (`projs`.`id` = 953125641)